GrumpyOldPizza/ArduinoCore-stm32l0/boards.txt
K33-L082Z-STL.menu.opt.os=Smallest Code
K33-L082Z-STL.menu.opt.os.build.flags.optimize=-Os
K33-L082Z-STL.menu.opt.os.build.flags.ldspecs=--specs=nano.specs
K33-L082Z-STL.menu.opt.o1=Fast
K33-L082Z-STL.menu.opt.o1.build.flags.optimize=-O1
K33-L082Z-STL.menu.opt.o1.build.flags.ldspecs=
K33-L082Z-STL.menu.opt.o2=Faster
K33-L082Z-STL.menu.opt.o2.build.flags.optimize=-O2
K33-L082Z-STL.menu.opt.o2.build.flags.ldspecs=
K33-L082Z-STL.menu.opt.o3=Fastest
K33-L082Z-STL.menu.opt.o3.build.flags.optimize=-O3
K33-L082Z-STL.menu.opt.o3.build.flags.ldspecs=


# UT2UH K33-L082Z-DFU
# ---------------------------------------
K33-L082Z-DFU.name=K33-L082Z-DFU
K33-L082Z-DFU.vid.0=0x0483
K33-L082Z-DFU.pid.0=0x5740

K33-L082Z-DFU.upload.tool=stm32l0_dfu
K33-L082Z-DFU.upload.protocol=dfu
K33-L082Z-DFU.upload.maximum_size=196608
K33-L082Z-DFU.upload.maximum_data_size=20480
K33-L082Z-DFU.upload.use_1200bps_touch=true
K33-L082Z-DFU.upload.wait_for_upload_port=false
K33-L082Z-DFU.upload.native_usb=true

K33-L082Z-DFU.build.mcu=cortex-m0plus
K33-L082Z-DFU.build.f_cpu=32000000L
K33-L082Z-DFU.build.board=K33_DFU
K33-L082Z-DFU.build.arch=stm32l0
K33-L082Z-DFU.build.core=arduino
K33-L082Z-DFU.build.vid=0x0483
K33-L082Z-DFU.build.pid=0x5740
K33-L082Z-DFU.build.did=0xffff
K33-L082Z-DFU.build.usb_manufacturer="UT2UH"
K33-L082Z-DFU.build.usb_product="K33"
K33-L082Z-DFU.build.extra_flags=-DSTM32L082xx -march=armv6-m -mthumb -mabi=aapcs -mfloat-abi=soft -fsingle-precision-constant {build.usb_flags}
K33-L082Z-DFU.build.ldscript=linker_scripts/STM32L082CZ_FLASH.ld
K33-L082Z-DFU.build.openocdscript=openocd_scripts/k33_usb.cfg
K33-L082Z-DFU.build.variant=K33-L082Z-DFU
K33-L082Z-DFU.build.variant_system_libs="-L{runtime.platform.path}/system/STM32L0xx/Lib" "-L{runtime.platform.path}/system/CMSIS/Lib" -lstm32l082xx -larm_cortexM0l_math
K33-L082Z-DFU.build.variant_system_include="-I{runtime.platform.path}/system/CMSIS/Include" "-I{runtime.platform.path}/system/CMSIS/Device/ST/STM32L0xx/Include" "-I{runtime.platform.path}/system/STM32L0xx/Include" 

K33-L082Z-DFU.menu.usb.cdc=Serial
K33-L082Z-DFU.menu.usb.cdc.build.usb_type=USB_TYPE_CDC
K33-L082Z-DFU.menu.usb.none=No USB
K33-L082Z-DFU.menu.usb.none.build.usb_type=USB_TYPE_NONE

K33-L082Z-DFU.menu.speed.32=32 MHz
K33-L082Z-DFU.menu.speed.32.build.f_cpu=32000000L
K33-L082Z-DFU.menu.speed.16=16 MHz (No USB)
K33-L082Z-DFU.menu.speed.16.build.f_cpu=16000000L
K33-L082Z-DFU.menu.speed.4=4.2 MHz (No USB)
K33-L082Z-DFU.menu.speed.4.build.f_cpu=4200000L

K33-L082Z-DFU.menu.opt.os=Smallest Code
K33-L082Z-DFU.menu.opt.os.build.flags.optimize=-Os
K33-L082Z-DFU.menu.opt.os.build.flags.ldspecs=--specs=nano.specs
K33-L082Z-DFU.menu.opt.o1=Fast
K33-L082Z-DFU.menu.opt.o1.build.flags.optimize=-O1
K33-L082Z-DFU.menu.opt.o1.build.flags.ldspecs=
K33-L082Z-DFU.menu.opt.o2=Faster
K33-L082Z-DFU.menu.opt.o2.build.flags.optimize=-O2
K33-L082Z-DFU.menu.opt.o2.build.flags.ldspecs=
K33-L082Z-DFU.menu.opt.o3=Fastest
K33-L082Z-DFU.menu.opt.o3.build.flags.optimize=-O3
K33-L082Z-DFU.menu.opt.o3.build.flags.ldspecs=


# UT2UH K48 S76G
# ---------------------------------------
K48-S76G.name=K48-S76G
K48-S76G.vid.0=0x0483
K48-S76G.pid.0=0x5740

K48-S76G.upload.tool=stm32l0_dfu
K48-S76G.upload.protocol=dfu
K48-S76G.upload.maximum_size=196608
K48-S76G.upload.maximum_data_size=20480
K48-S76G.upload.use_1200bps_touch=true
K48-S76G.upload.wait_for_upload_port=false
K48-S76G.upload.native_usb=true

K48-S76G.build.mcu=cortex-m0plus
K48-S76G.build.f_cpu=32000000L
K48-S76G.build.board=K48_S76G
K48-S76G.build.arch=stm32l0
K48-S76G.build.core=arduino
K48-S76G.build.vid=0x0483
K48-S76G.build.pid=0x5740
K48-S76G.build.did=0xffff
K48-S76G.build.usb_manufacturer="UT2UH"
K48-S76G.build.usb_product="K48"
K48-S76G.build.extra_flags=-DSTM32L072xx -march=armv6-m -mthumb -mabi=aapcs -mfloat-abi=soft -fsingle-precision-constant {build.usb_flags}
K48-S76G.build.ldscript=linker_scripts/STM32L073RZ_FLASH.ld
K48-S76G.build.openocdscript=openocd_scripts/s7Xg-l073rz.cfg
K48-S76G.build.variant=K48-S76G
K48-S76G.build.variant_system_libs="-L{runtime.platform.path}/system/STM32L0xx/Lib" "-L{runtime.platform.path}/system/CMSIS/Lib" -lstm32l072xx -larm_cortexM0l_math
K48-S76G.build.variant_system_include="-I{runtime.platform.path}/system/CMSIS/Include" "-I{runtime.platform.path}/system/CMSIS/Device/ST/STM32L0xx/Include" "-I{runtime.platform.path}/system/STM32L0xx/Include" 

K48-S76G.menu.usb.cdc=Serial
K48-S76G.menu.usb.cdc.build.usb_type=USB_TYPE_CDC
K48-S76G.menu.usb.none=No USB
K48-S76G.menu.usb.none.build.usb_type=USB_TYPE_NONE

K48-S76G.menu.speed.32=32 MHz
K48-S76G.menu.speed.32.build.f_cpu=32000000L

K48-S76G.menu.opt.os=Smallest Code
K48-S76G.menu.opt.os.build.flags.optimize=-Os
K48-S76G.menu.opt.os.build.flags.ldspecs=--specs=nano.specs
K48-S76G.menu.opt.o1=Fast
K48-S76G.menu.opt.o1.build.flags.optimize=-O1
K48-S76G.menu.opt.o1.build.flags.ldspecs=
K48-S76G.menu.opt.o2=Faster
K48-S76G.menu.opt.o2.build.flags.optimize=-O2
K48-S76G.menu.opt.o2.build.flags.ldspecs=
K48-S76G.menu.opt.o3=Fastest
K48-S76G.menu.opt.o3.build.flags.optimize=-O3
K48-S76G.menu.opt.o3.build.flags.ldspecs=


# UT2UH K48 S76G w/o SWD
# ---------------------------------------
K48-S76G-SWD.name=K48-S76G-SWD
K48-S76G-SWD.vid.0=0x0483
K48-S76G-SWD.pid.0=0x5740

K48-S76G-SWD.upload.tool=stm32l0_dfu
K48-S76G-SWD.upload.protocol=dfu
K48-S76G-SWD.upload.maximum_size=196608
K48-S76G-SWD.upload.maximum_data_size=20480
K48-S76G-SWD.upload.use_1200bps_touch=true
K48-S76G-SWD.upload.wait_for_upload_port=false
K48-S76G-SWD.upload.native_usb=true

K48-S76G-SWD.build.mcu=cortex-m0plus
K48-S76G-SWD.build.f_cpu=32000000L
K48-S76G-SWD.build.board=K48_S76G_SWD
K48-S76G-SWD.build.arch=stm32l0
K48-S76G-SWD.build.core=arduino
K48-S76G-SWD.build.vid=0x0483
K48-S76G-SWD.build.pid=0x5740
K48-S76G-SWD.build.did=0xffff
K48-S76G-SWD.build.usb_manufacturer="UT2UH"
K48-S76G-SWD.build.usb_product="K48"
K48-S76G-SWD.build.extra_flags=-DSTM32L072xx -march=armv6-m -mthumb -mabi=aapcs -mfloat-abi=soft -fsingle-precision-constant {build.usb_flags}
K48-S76G-SWD.build.ldscript=linker_scripts/STM32L073RZ_FLASH.ld
K48-S76G-SWD.build.openocdscript=openocd_scripts/s7Xg-l073rz.cfg
K48-S76G-SWD.build.variant=K48-S76G-SWD
K48-S76G-SWD.build.variant_system_libs="-L{runtime.platform.path}/system/STM32L0xx/Lib" "-L{runtime.platform.path}/system/CMSIS/Lib" -lstm32l072xx -larm_cortexM0l_math
K48-S76G-SWD.build.variant_system_include="-I{runtime.platform.path}/system/CMSIS/Include" "-I{runtime.platform.path}/system/CMSIS/Device/ST/STM32L0xx/Include" "-I{runtime.platform.path}/system/STM32L0xx/Include" 

K48-S76G-SWD.menu.usb.cdc=Serial
K48-S76G-SWD.menu.usb.cdc.build.usb_type=USB_TYPE_CDC
K48-S76G-SWD.menu.usb.none=No USB
K48-S76G-SWD.menu.usb.none.build.usb_type=USB_TYPE_NONE

K48-S76G-SWD.menu.speed.32=32 MHz
K48-S76G-SWD.menu.speed.32.build.f_cpu=32000000L

