GrumpyOldPizza/ArduinoCore-stm32l0/boards.txt
K76-S76S.menu.speed.32=32 MHz
K76-S76S.menu.speed.32.build.f_cpu=32000000L

K76-S76S.menu.opt.os=Smallest Code
K76-S76S.menu.opt.os.build.flags.optimize=-Os
K76-S76S.menu.opt.os.build.flags.ldspecs=--specs=nano.specs
K76-S76S.menu.opt.o1=Fast
K76-S76S.menu.opt.o1.build.flags.optimize=-O1
K76-S76S.menu.opt.o1.build.flags.ldspecs=
K76-S76S.menu.opt.o2=Faster
K76-S76S.menu.opt.o2.build.flags.optimize=-O2
K76-S76S.menu.opt.o2.build.flags.ldspecs=
K76-S76S.menu.opt.o3=Fastest
K76-S76S.menu.opt.o3.build.flags.optimize=-O3
K76-S76S.menu.opt.o3.build.flags.ldspecs=


# UT2UH K76 S76S
# ---------------------------------------
K76-S76S-STLINK.name=K76-S76S-STLINK
K76-S76S-STLINK.vid=0x0483
K76-S76S-STLINK.pid=0x5740

K76-S76S-STLINK.upload.tool=stm32l0_openocd
K76-S76S-STLINK.upload.protocol=stlink
K76-S76S-STLINK.upload.maximum_size=196608
K76-S76S-STLINK.upload.maximum_data_size=20480
K76-S76S-STLINK.upload.use_1200bps_touch=false
K76-S76S-STLINK.upload.wait_for_upload_port=false
K76-S76S-STLINK.upload.native_usb=false

K76-S76S-STLINK.build.mcu=cortex-m0plus
K76-S76S-STLINK.build.f_cpu=32000000L
K76-S76S-STLINK.build.board=K76_S76S_STL
K76-S76S-STLINK.build.arch=stm32l0
K76-S76S-STLINK.build.core=arduino
K76-S76S-STLINK.build.vid=0x0483
K76-S76S-STLINK.build.pid=0x5740
K76-S76S-STLINK.build.did=0xffff
K76-S76S-STLINK.build.usb_manufacturer="UT2UH"
K76-S76S-STLINK.build.usb_product="K76"
K76-S76S-STLINK.build.extra_flags=-DSTM32L072xx -march=armv6-m -mthumb -mabi=aapcs -mfloat-abi=soft -fsingle-precision-constant {build.usb_flags}
K76-S76S-STLINK.build.ldscript=linker_scripts/STM32L073RZ_FLASH.ld
K76-S76S-STLINK.build.openocdscript=openocd_scripts/s7Xs-l073rz.cfg
K76-S76S-STLINK.build.variant=K76-S76S-STLINK
K76-S76S-STLINK.build.variant_system_libs="-L{runtime.platform.path}/system/STM32L0xx/Lib" "-L{runtime.platform.path}/system/CMSIS/Lib" -lstm32l072xx -larm_cortexM0l_math
K76-S76S-STLINK.build.variant_system_include="-I{runtime.platform.path}/system/CMSIS/Include" "-I{runtime.platform.path}/system/CMSIS/Device/ST/STM32L0xx/Include" "-I{runtime.platform.path}/system/STM32L0xx/Include" 

K76-S76S-STLINK.menu.speed.32=32 MHz
K76-S76S-STLINK.menu.speed.32.build.f_cpu=32000000L
K76-S76S-STLINK.menu.speed.16=16 MHz
K76-S76S-STLINK.menu.speed.16.build.f_cpu=16000000L
K76-S76S-STLINK.menu.speed.4=4.2 MHz
K76-S76S-STLINK.menu.speed.4.build.f_cpu=4200000L

K76-S76S-STLINK.menu.opt.os=Smallest Code
K76-S76S-STLINK.menu.opt.os.build.flags.optimize=-Os
K76-S76S-STLINK.menu.opt.os.build.flags.ldspecs=--specs=nano.specs
K76-S76S-STLINK.menu.opt.o1=Fast
K76-S76S-STLINK.menu.opt.o1.build.flags.optimize=-O1
K76-S76S-STLINK.menu.opt.o1.build.flags.ldspecs=
K76-S76S-STLINK.menu.opt.o2=Faster
K76-S76S-STLINK.menu.opt.o2.build.flags.optimize=-O2
K76-S76S-STLINK.menu.opt.o2.build.flags.ldspecs=
K76-S76S-STLINK.menu.opt.o3=Fastest
K76-S76S-STLINK.menu.opt.o3.build.flags.optimize=-O3
K76-S76S-STLINK.menu.opt.o3.build.flags.ldspecs=


# UT2UH K92 L072Z
# ---------------------------------------
K92-L072Z.name=K92-L072Z
K92-L072Z.vid.0=0x0483
K92-L072Z.pid.0=0x5740

K92-L072Z.upload.tool=stm32l0_openocd
K92-L072Z.upload.protocol=stlink
K92-L072Z.upload.maximum_size=196608
K92-L072Z.upload.maximum_data_size=20480
K92-L072Z.upload.use_1200bps_touch=false
K92-L072Z.upload.wait_for_upload_port=false
K92-L072Z.upload.native_usb=false

K92-L072Z.build.mcu=cortex-m0plus
K92-L072Z.build.f_cpu=32000000L
K92-L072Z.build.board=K92_L072Z
K92-L072Z.build.arch=stm32l0
K92-L072Z.build.core=arduino
K92-L072Z.build.vid=0x0483
K92-L072Z.build.pid=0x5740
K92-L072Z.build.did=0xffff
K92-L072Z.build.usb_manufacturer="UT2UH"
K92-L072Z.build.usb_product="K92"
K92-L072Z.build.extra_flags=-DSTM32L072xx -march=armv6-m -mthumb -mabi=aapcs -mfloat-abi=soft -fsingle-precision-constant {build.usb_flags}
K92-L072Z.build.ldscript=linker_scripts/STM32L072CZ_FLASH.ld
K92-L072Z.build.openocdscript=openocd_scripts/lgt92_l072cz.cfg
K92-L072Z.build.variant=K92-L072Z
K92-L072Z.build.variant_system_libs="-L{runtime.platform.path}/system/STM32L0xx/Lib" "-L{runtime.platform.path}/system/CMSIS/Lib" -lstm32l072xx -larm_cortexM0l_math
K92-L072Z.build.variant_system_include="-I{runtime.platform.path}/system/CMSIS/Include" "-I{runtime.platform.path}/system/CMSIS/Device/ST/STM32L0xx/Include" "-I{runtime.platform.path}/system/STM32L0xx/Include" 

K92-L072Z.menu.speed.32=32 MHz
K92-L072Z.menu.speed.32.build.f_cpu=32000000L
K92-L072Z.menu.speed.16=16 MHz (No USB)
K92-L072Z.menu.speed.16.build.f_cpu=16000000L
K92-L072Z.menu.speed.4=4.2 MHz (No USB)
K92-L072Z.menu.speed.4.build.f_cpu=4200000L

K92-L072Z.menu.opt.os=Smallest Code
K92-L072Z.menu.opt.os.build.flags.optimize=-Os
K92-L072Z.menu.opt.os.build.flags.ldspecs=--specs=nano.specs
K92-L072Z.menu.opt.o1=Fast
K92-L072Z.menu.opt.o1.build.flags.optimize=-O1
K92-L072Z.menu.opt.o1.build.flags.ldspecs=
K92-L072Z.menu.opt.o2=Faster
K92-L072Z.menu.opt.o2.build.flags.optimize=-O2
K92-L072Z.menu.opt.o2.build.flags.ldspecs=
K92-L072Z.menu.opt.o3=Fastest
K92-L072Z.menu.opt.o3.build.flags.optimize=-O3
K92-L072Z.menu.opt.o3.build.flags.ldspecs=


# DRAGINO LGT92 L072Z
# ---------------------------------------
LGT92-L072Z.name=LGT92-L072Z
LGT92-L072Z.vid.0=0x0483
LGT92-L072Z.pid.0=0x5740

LGT92-L072Z.upload.tool=stm32l0_openocd
LGT92-L072Z.upload.protocol=stlink
LGT92-L072Z.upload.maximum_size=196608
LGT92-L072Z.upload.maximum_data_size=20480
LGT92-L072Z.upload.use_1200bps_touch=false
LGT92-L072Z.upload.wait_for_upload_port=false
LGT92-L072Z.upload.native_usb=false

LGT92-L072Z.build.mcu=cortex-m0plus
LGT92-L072Z.build.f_cpu=32000000L
LGT92-L072Z.build.board=LGT92
LGT92-L072Z.build.arch=stm32l0
LGT92-L072Z.build.core=arduino
LGT92-L072Z.build.vid=0x0483
LGT92-L072Z.build.pid=0x5740
LGT92-L072Z.build.did=0xffff
LGT92-L072Z.build.usb_manufacturer="DRAGINO"
LGT92-L072Z.build.usb_product="LGT92"
LGT92-L072Z.build.extra_flags=-DSTM32L072xx -march=armv6-m -mthumb -mabi=aapcs -mfloat-abi=soft -fsingle-precision-constant {build.usb_flags}
LGT92-L072Z.build.ldscript=linker_scripts/STM32L072CZ_FLASH.ld
LGT92-L072Z.build.openocdscript=openocd_scripts/lgt92_l072cz.cfg
LGT92-L072Z.build.variant=LGT92-L072Z
LGT92-L072Z.build.variant_system_libs="-L{runtime.platform.path}/system/STM32L0xx/Lib" "-L{runtime.platform.path}/system/CMSIS/Lib" -lstm32l072xx -larm_cortexM0l_math
LGT92-L072Z.build.variant_system_include="-I{runtime.platform.path}/system/CMSIS/Include" "-I{runtime.platform.path}/system/CMSIS/Device/ST/STM32L0xx/Include" "-I{runtime.platform.path}/system/STM32L0xx/Include" 

LGT92-L072Z.menu.speed.32=32 MHz
LGT92-L072Z.menu.speed.32.build.f_cpu=32000000L
LGT92-L072Z.menu.speed.16=16 MHz (No USB)
LGT92-L072Z.menu.speed.16.build.f_cpu=16000000L
LGT92-L072Z.menu.speed.4=4.2 MHz (No USB)
LGT92-L072Z.menu.speed.4.build.f_cpu=4200000L

LGT92-L072Z.menu.opt.os=Smallest Code
LGT92-L072Z.menu.opt.os.build.flags.optimize=-Os
LGT92-L072Z.menu.opt.os.build.flags.ldspecs=--specs=nano.specs
LGT92-L072Z.menu.opt.o1=Fast
LGT92-L072Z.menu.opt.o1.build.flags.optimize=-O1
LGT92-L072Z.menu.opt.o1.build.flags.ldspecs=
LGT92-L072Z.menu.opt.o2=Faster
LGT92-L072Z.menu.opt.o2.build.flags.optimize=-O2
LGT92-L072Z.menu.opt.o2.build.flags.ldspecs=
LGT92-L072Z.menu.opt.o3=Fastest
LGT92-L072Z.menu.opt.o3.build.flags.optimize=-O3
LGT92-L072Z.menu.opt.o3.build.flags.ldspecs=


